#include <stdio.h>
/*
Написать программы, реализующие алгоритмы сортировки
вставками (метод Шелла, сортировка с вычислением адреса).
Сравнить их эффективность (число сравнений и перестановок) для
наилучшего и наихудшего вариантов последовательностей
*/
int main()
{
	printf("Hello World!\n");
	return 0;
}
